In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("D:\\DataSet\\Ev Sales.xlsx")

In [3]:
df.to_csv("D:\\DataSet\\Changed_data.csv")

In [4]:
df.describe(percentiles=[0.7,0.3,0.4])

,YEAR,2 W,3 W,4 W,BUS,TOTAL
count,74,74.000000,74.000000,74.000000,74.000000,74.000000
mean,2020-04-16 04:12:58.378378496,16938.729730,14851.351351,1272.567568,82.310811,33144.959459
min,2017-04-01 00:00:00,85.000000,668.000000,3.000000,0.000000,958.000000
30%,2019-01-28 21:36:00,1556.000000,8225.500000,197.700000,18.900000,10942.900000
40%,2019-09-07 00:00:00,2239.400000,9037.400000,232.400000,44.800000,12293.800000
50%,2020-04-16 00:00:00,3014.500000,10619.500000,317.500000,74.500000,14526.000000
70%,2021-07-04 02:24:00,14808.500000,14992.200000,1207.800000,97.100000,28170.100000
max,2023-05-01 00:00:00,105154.000000,45225.000000,8852.000000,331.000000,157788.000000
std,NaN,25846.636971,11002.517635,1841.195763,79.696672,38251.453387

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   YEAR    74 non-null     datetime64[ns]
 1   2 W     74 non-null     int64
 2   3 W     74 non-null     int64
 3   4 W     74 non-null     int64
 4   BUS     74 non-null     int64
 5   TOTAL   74 non-null     int64
dtypes: datetime64[ns](1), int64(5)
memory usage: 3.6 KB

In [6]:
df.shape

(74, 6)

In [7]:
df.shape[0]

74

In [8]:
df.shape[1]

6

In [9]:
df.columns

Index(['YEAR', '2 W', '3 W', '4 W', 'BUS', 'TOTAL'], dtype='object')

In [10]:
list(df.columns)

['YEAR', '2 W', '3 W', '4 W', 'BUS', 'TOTAL']

In [11]:
df2 = df.copy()

In [12]:
df2.loc[2:7,'2 W'] = None

In [13]:
df2.head(10)

        YEAR    2 W   3 W  4 W  BUS  TOTAL
0 2017-04-01   96.0  4748  198    0   5042
1 2017-05-01   91.0  6720  215    2   7028
2 2017-06-01    NaN  7178  149    1   7465
3 2017-07-01    NaN  8775  120    0   9011
4 2017-08-01    NaN  8905  137    0   9141
5 2017-09-01    NaN  7414  193    0   7716
6 2017-10-01    NaN  7250  214    0   7624
7 2017-11-01    NaN  9598  186   11  10009
8 2017-12-01  189.0  8719  179    0   9087
9 2018-01-01  176.0  8750  210   29   9165

In [14]:
df2.isnull()

     YEAR    2 W    3 W    4 W    BUS  TOTAL
0   False  False  False  False  False  False
1   False  False  False  False  False  False
2   False   True  False  False  False  False
3   False   True  False  False  False  False
4   False   True  False  False  False  False
..    ...    ...    ...    ...    ...    ...
69  False  False  False  False  False  False
70  False  False  False  False  False  False
71  False  False  False  False  False  False
72  False  False  False  False  False  False
73  False  False  False  False  False  False

[74 rows x 6 columns]

In [15]:
df2.isnull().sum()

YEAR     0
2 W      6
3 W      0
4 W      0
BUS      0
TOTAL    0
dtype: int64

In [16]:
df['2 W'].head()

0     96
1     91
2    137
3    116
4     99
Name: 2 W, dtype: int64

In [17]:
df[['2 W','4 W']].head()

   2 W  4 W
0   96  198
1   91  215
2  137  149
3  116  120
4   99  137

In [18]:
df[df.index == 4]

        YEAR  2 W   3 W  4 W  BUS  TOTAL
4 2017-08-01   99  8905  137    0   9141

In [19]:
df[df.index.isin(range(2,8))]

        YEAR  2 W   3 W  4 W  BUS  TOTAL
2 2017-06-01  137  7178  149    1   7465
3 2017-07-01  116  8775  120    0   9011
4 2017-08-01   99  8905  137    0   9141
5 2017-09-01  109  7414  193    0   7716
6 2017-10-01  160  7250  214    0   7624
7 2017-11-01  214  9598  186   11  10009

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   YEAR    74 non-null     datetime64[ns]
 1   2 W     68 non-null     float64
 2   3 W     74 non-null     int64
 3   4 W     74 non-null     int64
 4   BUS     74 non-null     int64
 5   TOTAL   74 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(4)
memory usage: 3.6 KB

In [21]:
df2.index = range(1,75)

In [22]:
df2.head()

        YEAR   2 W   3 W  4 W  BUS  TOTAL
1 2017-04-01  96.0  4748  198    0   5042
2 2017-05-01  91.0  6720  215    2   7028
3 2017-06-01   NaN  7178  149    1   7465
4 2017-07-01   NaN  8775  120    0   9011
5 2017-08-01   NaN  8905  137    0   9141

In [23]:
df.iloc[2:8,[1,3]]

   2 W  4 W
2  137  149
3  116  120
4   99  137
5  109  193
6  160  214
7  214  186

In [24]:
df[df.TOTAL == 9011]

        YEAR  2 W   3 W  4 W  BUS  TOTAL
3 2017-07-01  116  8775  120    0   9011

In [29]:
df[df.TOTAL > 120000]

         YEAR     2 W    3 W   4 W  BUS   TOTAL
67 2022-11-01   76700  40403  4027  118  121248
71 2023-03-01   86194  45225  8852   89  140360
73 2023-05-01  105154  44615  7736  283  157788

In [28]:
df.loc[df['TOTAL'] > 120000,['BUS' , 'YEAR']]

    BUS       YEAR
67  118 2022-11-01
71   89 2023-03-01
73  283 2023-05-01